{"config": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 28, 28, 1], "trainable": true, "name": "flatten_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 512, "name": "dense_1", "activation": "linear", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 512, "name": "dense_2", "activation": "linear", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2", "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "units": 10, "name": "dense_3", "activation": "linear", "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_3"}}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.3"}